In [1]:
import pandas as pd

In [2]:
sales_data = pd.read_csv(r"C:\Users\srini\OneDrive\Documents\pythonFiles\sales1.csv")

In [16]:
sales_data.head(100)

         date region             rep    product  sales
0  01-01-2022  North        John Doe  Product A    100
1  02-01-2022  North        John Doe  Product A    120
2  03-01-2022  North      Jane Smith  Product B    150
3  04-01-2022  South       Jim Brown  Product C     80
4  05-01-2022  South       Jim Brown  Product C     90
5  06-01-2022   East  Robert Johnson  Product D    130
6  07-01-2022   East  Robert Johnson  Product D    140
7  08-01-2022   West     Emily Davis  Product A    110
8  09-01-2022   West     Emily Davis  Product A    120
9  10-01-2022   West     Michael Lee  Product B    160

In [4]:
region_sales = sales_data.groupby('region')['sales'].sum()
region_sales

region
East     270
North    370
South    170
West     390
Name: sales, dtype: int64

In [5]:
product_sales = sales_data.groupby('product')['sales'].mean().reset_index()
product_sales

     product  sales
0  Product A  112.5
1  Product B  155.0
2  Product C   85.0
3  Product D  135.0

In [6]:
data1 = {'region': ['North', 'South', 'East', 'West'],
        'sales': [400, 200, 150, 250]}

In [7]:
pf = pd.DataFrame(data1)
pf

  region  sales
0  North    400
1  South    200
2   East    150
3   West    250

In [8]:
pf.set_index('region',inplace=True)

In [9]:
pf

        sales
region
North     400
South     200
East      150
West      250

In [10]:
# Reset the index of the DataFrame
de_reset = pf.reset_index()

In [11]:
pf

        sales
region
North     400
South     200
East      150
West      250

In [12]:
de_reset

  region  sales
0  North    400
1  South    200
2   East    150
3   West    250

#https://www.blackbox.ai/share/b20acf84-4559-40f1-9733-37937f14ec02

<b>Groupby</b>

The groupby method in pandas is used to group a DataFrame by one or more columns. It returns a GroupBy object that can be used to perform various operations on the groups.

In the example code, we used the groupby method to group the sales_data DataFrame by the region column:

In [23]:
region_sales = sales_data.groupby('region')['sales'].sum()
region_sales.dtypes

dtype('int64')

<b>Reset Index</b>

The reset_index method in pandas is used to reset the index of a DataFrame or Series. It returns a new DataFrame or Series with the original index values as a column.

In the example code, we used the reset_index method to convert the region_sales Series into a DataFrame:

In [22]:
region_sales = sales_data.groupby('region')['sales'].sum().reset_index()
region_sales.dtypes

region    object
sales      int64
dtype: object

<b>Renaming Columns</b>

The rename method in pandas is used to rename the columns of a DataFrame. It returns a new DataFrame with the renamed columns.

In the example code, we used the rename method to rename the region column to region_name in the region_sales DataFrame:

In [34]:
region_sales1 = pd.DataFrame(region_sales)
region_sales.rename(columns={'region':'region_sales'})

TypeError: Series.rename() got an unexpected keyword argument 'columns'